Revit 2024 API
FabricSheetType.GetWireItem Method
 Gets the Wire stored in the FabricSheetType at the associated index.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public FabricWireItem GetWireItem(
	int wireIndex,
	WireDistributionDirection direction
)
Visual Basic
Public Function GetWireItem ( _
	wireIndex As Integer, _
	direction As WireDistributionDirection _
) As FabricWireItem
Visual C++
public:
FabricWireItem^ GetWireItem(
	int wireIndex,
	WireDistributionDirection direction
)
Parameters
wireIndex
Type: System.Int32
 Item index in the Fabric Sheet
direction
Type: Autodesk.Revit.DB.Structure.WireDistributionDirection
 Wire distribution direction of the inquired item
Return Value
 Fabric wire Item
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The item index is either less than 0 or greater than or equal to number of items in this FabricSheetType.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.InvalidOperationException |  Fabric Sheet is not Custom
See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace